Documents/ЛБ_ПриказРежимРаботы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ЛБ_ПриказРежимРаботы</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ЛБ_ГрафикРаботыЛомбардаПостоянный</xr:Item>
				<xr:Item>InformationRegister.ЛБ_ГрафикРаботыЛомбардаВременный</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПриказа</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_ВидыПриказаРежимаРаботы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ОтделенияЛомбардов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подписант</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_СтатусыПриказовРежимРаботы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БезПерерыва</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтветственныйСотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Архив</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтветственныйПользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>РежимРаботы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>День</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ЛБ_ДниНедели</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Начало</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Time</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Окончание</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Time</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПерерывНачало</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Time</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПерерывОкончание</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Time</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерДня</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ломбард</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЛБ_Ломбарды</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Выходной</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>БезПерерыва</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/ЛБ_ОтделенияЛомбардов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЛБ_ОтделенияЛомбардов</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Отделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ОтделенияЛомбардов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Центральный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Ломбард</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Ломбарды</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ЛБ_ВидыПриказаРежимаРаботы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ЛБ_ВидыПриказаРежимаРаботы</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Постоянный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Временный</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ЛБ_ДниНедели.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ЛБ_ДниНедели</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Понедельник</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Вторник</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Среда</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Четверг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Пятница</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Суббота</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Воскресенье</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ЛБ_СтатусыПриказовРежимРаботы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ЛБ_СтатусыПриказовРежимРаботы</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Проект</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Факт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Архив</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/ЛБ_Ломбарды.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ЛБ_Ломбарды</Name>
			<Comment>Ломбарды</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнаяСхемаКредитования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_СхемыКредитования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Префикс</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦентральныйФилиал</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДневнойЛимитВыдачиЗаймов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазовыйЛимитВыдачиЗаймов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерФН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>24</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>id_LX</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерЛомбарда</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Закрыт</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьПрефиксВНомереЗБ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерЧисловой</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>КонтактнаяИнформация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначенияПолей</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Страна</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Регион</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Город</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресЭП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоменноеИмяСервера</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаБезКодов</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СхемыКредитования</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СхемаКредитования</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Documents/ЛБ_ПриказРежимРаботы/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Перем ОтказатьВПроведении;
&НаКлиенте
Перем глПараметрыЗаписи;

Процедура ДобавитьСтрокуДня(День, НомерДня, Ломбард)
	НовСтр = Объект.РежимРаботы.Добавить();
	НовСтр.День     = День;
	НовСтр.НомерДня = НомерДня;
	НовСтр.Ломбард  = Ломбард;
КонецПроцедуры

&НаСервере
Процедура УстановитьСтатусДокумента()  
	Если Объект.Архив Тогда 
		ЭтаФорма.СтатусДокумента = "АРХИВ"; 
		Элементы.СтатусДокумента.ЦветТекста = WebЦвета.Черный;
	Иначе 
		Если Объект.Проведен Тогда
			ЭтаФорма.СтатусДокумента = "ФАКТ"; 
			Элементы.СтатусДокумента.ЦветТекста = WebЦвета.Зеленый;
		Иначе
			ЭтаФорма.СтатусДокумента = "ПРОЕКТ"; 
			Элементы.СтатусДокумента.ЦветТекста = WebЦвета.Черный;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Процедура УстановитьДоступностьЭлементов() 
	Если Объект.Архив Или Объект.Проведен Тогда
		ЭтаФорма.ТолькоПросмотр = Истина;
		Элементы.РежимРаботыДобавитьЛомбард.Доступность = Ложь; 
		Элементы.РежимРаботыУдалитьЛомбард.Доступность = Ложь;
		Элементы.РежимРаботыКнопкаСкопировать.Доступность = Ложь;
		Элементы.РежимРаботыБезПерерываВсеГалочки.Доступность = Ложь;
		Элементы.РежимРаботыБезПерерываСнятьГалочки.Доступность = Ложь; 
		Если НЕ Объект.Архив Тогда
			Элементы.ФормаКнопка2.Доступность = Истина; 
			Элементы.ФормаКнопка1.Доступность = Истина;
		Иначе
			Элементы.ФормаКнопка2.Доступность = Ложь;
			Элементы.ФормаКнопка1.Доступность = Ложь;
		КонецЕсли;  
	Иначе 
		//Элементы.РежимРаботыДобавитьЛомбард.Доступность = Истина; 
		//Элементы.РежимРаботыУдалитьЛомбард.Доступность = Ложь;
		Элементы.РежимРаботыКнопкаСкопировать.Доступность = Истина;
		Элементы.РежимРаботыБезПерерываВсеГалочки.Доступность = Истина;
		Элементы.РежимРаботыБезПерерываСнятьГалочки.Доступность = Истина; 

	КонецЕсли;		
	
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект); 

                                                                      
	Директор = ЛБ_ОбщийМодуль.ПолучитьЗначениеДопНастройки("Директор");
	ПервыйЗаместитель = ЛБ_ОбщийМодуль.ПолучитьЗначениеДопНастройки("ПервыйЗаместительДиректора");
	
	ДиректорСтр = ФизическиеЛицаКлиентСервер.ФамилияИнициалы(СокрЛП(Директор)); 
	ПервыйЗаместительСтр = ФизическиеЛицаКлиентСервер.ФамилияИнициалы(СокрЛП(ПервыйЗаместитель));
	
	Элементы.Подписант.СписокВыбора.Добавить(Директор, СокрЛП(ДиректорСтр) + " (Директор)"); 
	Элементы.Подписант.СписокВыбора.Добавить(ПервыйЗаместитель, СокрЛП(ПервыйЗаместительСтр) + " (Первый заместитель)");
	
	Если Параметры.Ключ.Пустая() Тогда
		Объект.ОтветственныйСотрудник = ПараметрыСеанса.ТекущийСотрудник;
		Объект.ОтветственныйПользователь = ПараметрыСеанса.ТекущийПользователь;

		Объект.Дата = ТекущаяДата();
	КонецЕсли; 
	
	
	ЕслиВыходнойВремяНеРедактируем(Элементы.РежимРаботыНачало.Имя);
	ЕслиВыходнойВремяНеРедактируем(Элементы.РежимРаботыОкончание.Имя);
	ЕслиВыходнойВремяНеРедактируем(Элементы.РежимРаботыПерерывНачало.Имя);
	ЕслиВыходнойВремяНеРедактируем(Элементы.РежимРаботыПерерывОкончание.Имя); 
	ЕслиВыходнойВремяНеРедактируем(Элементы.РежимРаботыБезПерерыва.Имя);
	
	ЕслиБезПерерываВремяНеРедактируем(Элементы.РежимРаботыПерерывНачало.Имя);
	ЕслиБезПерерываВремяНеРедактируем(Элементы.РежимРаботыПерерывОкончание.Имя);  
	
	Если Объект.Проведен Тогда  
		Этаформа.ТолькоПросмотр = Истина; 
	КонецЕсли; 
	
	УстановитьСтатусДокумента();
	УстановитьДоступностьЭлементов();
КонецПроцедуры

Процедура ЕслиВыходнойВремяНеРедактируем(Элем) 
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элем);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.РежимРаботы.Выходной");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);	
КонецПроцедуры

Процедура ЕслиБезПерерываВремяНеРедактируем(Элем) 
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элем);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.РежимРаботы.БезПерерыва");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);	
КонецПроцедуры


&НаКлиенте
Процедура СкопироватьВНиз(Команда) 
	ТекСтр = Элементы.РежимРаботы.ТекущиеДанные; 
	ЗапомниСтр = ТекСтр.НомерСтроки;
	Для каждого стр из Объект.РежимРаботы Цикл 
		Если стр.НомерСтроки > ЗапомниСтр Тогда
			Если стр.Ломбард = ТекСтр.Ломбард Тогда
				
				Если стр.Выходной Тогда
					стр.Начало = "";
					стр.Окончание = ""; 
					стр.ПерерывНачало = "";
					стр.ПерерывОкончание = ""; 
				Иначе 				
					стр.Начало = ТекСтр.Начало;
					стр.Окончание = ТекСтр.Окончание;
					стр.ПерерывНачало = ТекСтр.ПерерывНачало;
					стр.ПерерывОкончание = ТекСтр.ПерерывОкончание; 
					стр.БезПерерыва = ТекСтр.БезПерерыва;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ВидПриказаПриИзменении(Элемент)
	УстановитьВидимость();
	Если Объект.ВидПриказа = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыПриказаРежимаРаботы.Постоянный") Тогда
		Объект.ДатаОкончания = "";
	КонецЕсли;
	ЗаполнитьЛомбардамиНаСервере();
КонецПроцедуры

&НаКлиенте	
Процедура УстановитьВидимость()  
	Если Объект.ВидПриказа = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыПриказаРежимаРаботы.Постоянный") Тогда
		Элементы.ДатаОкончания.Видимость = Ложь;
		Элементы.РежимРаботыДобавитьЛомбард.Видимость = Ложь; 
		Элементы.РежимРаботыУдалитьЛомбард.Видимость = Ложь;   
		Элементы.РежимРаботыЗаполнитьИзПредыдущего.Видимость = Истина;
	Иначе 
		Элементы.ДатаОкончания.Видимость = Истина; 	
		Элементы.РежимРаботыДобавитьЛомбард.Видимость = Истина; 
		Элементы.РежимРаботыУдалитьЛомбард.Видимость = Истина; 
		Элементы.РежимРаботыЗаполнитьИзПредыдущего.Видимость = Ложь;

	КонецЕсли;
	
	Элементы.РежимРаботыПерерывНачало.Видимость = НЕ Объект.БезПерерыва;
	Элементы.РежимРаботыПерерывОкончание.Видимость = НЕ Объект.БезПерерыва;
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьВидимость();
КонецПроцедуры

&НаКлиенте
Процедура ОтделениеПриИзменении(Элемент)
	ЗаполнитьЛомбардамиНаСервере();
КонецПроцедуры   

&НаСервере
Процедура ЗаполнитьЛомбардамиНаСервере()  
	Объект.РежимРаботы.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст ="ВЫБРАТЬ
	              |	ЛБ_ОтделенияЛомбардовСрезПоследних.Ломбард КАК Ломбард
	              |ИЗ
	              |	РегистрСведений.ЛБ_ОтделенияЛомбардов.СрезПоследних КАК ЛБ_ОтделенияЛомбардовСрезПоследних
	              |ГДЕ
	              |	ЛБ_ОтделенияЛомбардовСрезПоследних.Отделение = &Отделение
	              |	И ЛБ_ОтделенияЛомбардовСрезПоследних.Ломбард.Закрыт = ЛОЖЬ
	              |
	              |УПОРЯДОЧИТЬ ПО
	              |	ЛБ_ОтделенияЛомбардовСрезПоследних.Ломбард.НомерЧисловой";
	Запрос.УстановитьПараметр("Отделение", Объект.Отделение);
	Выборка = Запрос.Выполнить().Выбрать(); 
	Пока Выборка.Следующий() Цикл	
		ДобавитьСтрокуДня(Перечисления.ЛБ_ДниНедели.Понедельник, 1, Выборка.Ломбард);
		ДобавитьСтрокуДня(Перечисления.ЛБ_ДниНедели.Вторник, 2, Выборка.Ломбард);
		ДобавитьСтрокуДня(Перечисления.ЛБ_ДниНедели.Среда, 3, Выборка.Ломбард);
		ДобавитьСтрокуДня(Перечисления.ЛБ_ДниНедели.Четверг, 4, Выборка.Ломбард);
		ДобавитьСтрокуДня(Перечисления.ЛБ_ДниНедели.Пятница, 5, Выборка.Ломбард);
		ДобавитьСтрокуДня(Перечисления.ЛБ_ДниНедели.Суббота, 6, Выборка.Ломбард);
		ДобавитьСтрокуДня(Перечисления.ЛБ_ДниНедели.Воскресенье, 7, Выборка.Ломбард);
	КонецЦикла;
	
	
КонецПроцедуры

&НаКлиенте
Процедура РежимРаботыВыходнойПриИзменении(Элемент)
	ТекСтр = Элементы.РежимРаботы.ТекущиеДанные;
	Если ТекСтр.Выходной Тогда
		ТекСтр.Начало = "";
		ТекСтр.Окончание = ""; 
		ТекСтр.ПерерывНачало = "";
		ТекСтр.ПерерывОкончание = "";
		ТекСтр.БезПерерыва = Ложь;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура БезПерерываПриИзменении(Элемент)
	УстановитьВидимость();
КонецПроцедуры


&НаКлиенте
Процедура РежимРаботыЛомбардНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	Если ЗначениеЗаполнено(Объект.Отделение) Тогда
		//СтандартнаяОбработка = Ложь;
		Элемент.РежимВыбораИзСписка = Истина;
	
		Элемент.СписокВыбора.Очистить();
	
		массивЛомбардов = СформироватьМассивЛомбардов();    
	
		Элемент.СписокВыбора.ЗагрузитьЗначения(массивЛомбардов);
	КонецЕсли;
КонецПроцедуры


Функция СформироватьМассивЛомбардов()
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_ОтделенияЛомбардовСрезПоследних.Ломбард КАК Ломбард
	               |ИЗ
	               |	РегистрСведений.ЛБ_ОтделенияЛомбардов.СрезПоследних(, Отделение = &Отделение) КАК ЛБ_ОтделенияЛомбардовСрезПоследних
				   |ГДЕ
	               |	ЛБ_ОтделенияЛомбардовСрезПоследних.Ломбард.Закрыт = Ложь";
 
	Запрос.УстановитьПараметр("Отделение", Объект.Отделение);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ломбард");
	
КонецФункции 

Функция СформироватьМассивЛомбардовНетВДокументе()
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_ОтделенияЛомбардовСрезПоследних.Ломбард КАК Ломбард
	               |ИЗ
	               |	РегистрСведений.ЛБ_ОтделенияЛомбардов.СрезПоследних(
	               |			,
	               |			Отделение = &Отделение
	               |				И НЕ Ломбард В (&МассивЛомбардов)) КАК ЛБ_ОтделенияЛомбардовСрезПоследних
	               |ГДЕ
	               |	ЛБ_ОтделенияЛомбардовСрезПоследних.Ломбард.Закрыт = ЛОЖЬ";
 
	Запрос.УстановитьПараметр("Отделение", Объект.Отделение); 
	масЛом  = МассивЛомбардовИзДокумента();
	Если масЛом.Количество() > 0 Тогда
		Запрос.УстановитьПараметр("МассивЛомбардов",масЛом);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И НЕ Ломбард В (&МассивЛомбардов)","");
	КонецЕсли;
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ломбард");
	
КонецФункции



&НаКлиенте
Процедура ДобавитьЛомбард(Команда)
	СтандартнаяОбработка = Ложь;

    НастройкиКД = Новый НастройкиКомпоновкиДанных;

    Отбор = НастройкиКД.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
    Отбор.ЛевоеЗначение    = Новый ПолеКомпоновкиДанных("Ссылка");
    Отбор.ВидСравнения     = ВидСравненияКомпоновкиДанных.ВСписке;
    Отбор.ПравоеЗначение   = СформироватьМассивЛомбардовНетВДокументе();
    Отбор.Использование    = Истина;
    Отбор.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
    // можно прописать не ограниченное количество отборов КД

    ПараметрыФормы = Новый Структура;
    ПараметрыФормы.Вставить("ФиксированныеНастройки", НастройкиКД);
	ПараметрыФормы.Вставить("ОтображениеТаблицы", ОтображениеТаблицы.Список);
	
	ОбработкаВыбора = Новый ОписаниеОповещения("ПриЗакрытииФормыВыбораЛомбарда", ЭтаФорма);

	ОткрытьФорму("Справочник.ЛБ_Ломбарды.ФормаВыбора",ПараметрыФормы,
	        ЭтаФорма, , , , ОбработкаВыбора);

КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытииФормыВыбораЛомбарда(Значение, ДопПараметры) Экспорт 
	Если Значение = Неопределено Тогда  
		Возврат;
	КонецЕсли;
	
	ДобавитьСтрокиЛомбарда(Значение);
	

	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытииФормыВыбораУдаленияЛомбарда(Значение, ДопПараметры) Экспорт 
	Если Значение = Неопределено Тогда  
		Возврат;
	КонецЕсли;
	
	УдалитьСтрокиЛомбарда(Значение); 

КонецПроцедуры  

Процедура УдалитьСтрокиЛомбарда(Ломб)
	СтруктураОтбора = Новый Структура("Ломбард", Ломб);
	
	МассивСтрок = Объект.РежимРаботы.НайтиСтроки(СтруктураОтбора);
	Для каждого ЭлементМассива Из МассивСтрок Цикл
		Объект.РежимРаботы.Удалить(ЭлементМассива);
	КонецЦикла;
КонецПроцедуры

&НаСервере  
Процедура ДобавитьСтрокиЛомбарда(ВыбЛомбард) 

	ДобавитьСтрокуДня(Перечисления.ЛБ_ДниНедели.Понедельник, 1, ВыбЛомбард);
	ДобавитьСтрокуДня(Перечисления.ЛБ_ДниНедели.Вторник, 2, ВыбЛомбард);
	ДобавитьСтрокуДня(Перечисления.ЛБ_ДниНедели.Среда, 3, ВыбЛомбард);
	ДобавитьСтрокуДня(Перечисления.ЛБ_ДниНедели.Четверг, 4, ВыбЛомбард);
	ДобавитьСтрокуДня(Перечисления.ЛБ_ДниНедели.Пятница, 5, ВыбЛомбард);
	ДобавитьСтрокуДня(Перечисления.ЛБ_ДниНедели.Суббота, 6, ВыбЛомбард);
	ДобавитьСтрокуДня(Перечисления.ЛБ_ДниНедели.Воскресенье, 7, ВыбЛомбард);
	              
    
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
    
	//Если ВыбранноеЗначение = Неопределено Тогда  
	//	Возврат;
	//КонецЕсли;
	//
	//ДобавитьСтрокиЛомбарда(ВыбранноеЗначение);


КонецПроцедуры

&НаКлиенте
Процедура ДатаОкончанияПриИзменении(Элемент)
	ПроверитьДатыНаСервере();
КонецПроцедуры

Процедура ПроверитьДатыНаСервере()
	Если Объект.ДатаОкончания < Объект.ДатаНачала Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Дата окончания не может быть меньше даты начала";
		Сообщение.Поле = "Объект.ДатаОкончания";
		Сообщение.Сообщить();  
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура УдалитьЛомбард(Команда)
	
	СтандартнаяОбработка = Ложь;

    НастройкиКД = Новый НастройкиКомпоновкиДанных;

    Отбор = НастройкиКД.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
    Отбор.ЛевоеЗначение    = Новый ПолеКомпоновкиДанных("Ссылка");
    Отбор.ВидСравнения     = ВидСравненияКомпоновкиДанных.ВСписке;
    Отбор.ПравоеЗначение   = МассивЛомбардовИзДокумента();
    Отбор.Использование    = Истина;
    Отбор.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
    // можно прописать не ограниченное количество отборов КД

    ПараметрыФормы = Новый Структура;
    ПараметрыФормы.Вставить("ФиксированныеНастройки", НастройкиКД);
	ПараметрыФормы.Вставить("ОтображениеТаблицы", ОтображениеТаблицы.Список);
	
	ОбработкаВыбора = Новый ОписаниеОповещения("ПриЗакрытииФормыВыбораУдаленияЛомбарда", ЭтаФорма);

	ОткрытьФорму("Справочник.ЛБ_Ломбарды.ФормаВыбора",ПараметрыФормы,
	        ЭтаФорма, , , , ОбработкаВыбора);

	
КонецПроцедуры 
		
Функция МассивЛомбардовИзДокумента()
	тзСтроки = Объект.РежимРаботы.Выгрузить(,"Ломбард");
	тзСтроки.Свернуть("Ломбард");
	Возврат тзСтроки.ВыгрузитьКолонку("Ломбард"); 
КонецФункции

&НаКлиенте
Процедура РежимРаботыПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаСервере
Процедура ПровестиДокументНаСервере()
	//Статус = Перечисления.ЛБ_СтатусыПриказовРежимРаботы.Факт; 
	Объект.Статус = Перечисления.ЛБ_СтатусыПриказовРежимРаботы.Факт;

	ДокОбъект = РеквизитФормыВЗначение("Объект");
    ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
	
	тзЛомбарды = Объект.РежимРаботы.Выгрузить(,"Ломбард");
	тзЛомбарды.Свернуть("Ломбард");
	МассивЛомб = тзЛомбарды.ВыгрузитьКолонку("Ломбард"); 
	
	ЛБ_ОбщийМодуль.ПересчетРежимовРаботыЛомбардов(МассивЛомб, 60, Ложь); 
КонецПроцедуры

//&НаКлиенте
//Процедура ПровестиДокумент(Команда)
//	
//	ПараметрыЗаписи = Новый Структура();
//	ПараметрыЗаписи.Вставить("РежимЗаписи", ПредопределенноеЗначение("РежимЗаписиДокумента.Проведение"));
//	ПараметрыЗаписи.Вставить("Закрыть", Ложь);
//	
//	Записать(ПараметрыЗаписи);
//	
//	
//	//Если ПроверитьСтатусФактДругиеПриказы() Тогда
//	//	
//	//Иначе  
//	//	ОчиститьСообщения();
//	//	ПровестиДокументНаСервере();
//	//	ЭтотОбъект.Прочитать(); 
//	//	Оповестить("Запись_РежимРаботы", Неопределено, Объект.Ссылка);
//	//КонецЕсли;
//КонецПроцедуры 



&НаСервере
Процедура РаспровестиДокументНаСервере()
	Статус = Перечисления.ЛБ_СтатусыПриказовРежимРаботы.Проект; 
	Объект.Статус = Перечисления.ЛБ_СтатусыПриказовРежимРаботы.Проект;
	ДокОбъект = РеквизитФормыВЗначение("Объект");
    ДокОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);  
КонецПроцедуры

&НаКлиенте
Процедура РаспровестиДокумент(Команда)
	РаспровестиДокументНаСервере();
	ЭтотОбъект.Прочитать();
	Оповестить("Запись_РежимРаботы", Неопределено, Объект.Ссылка);
КонецПроцедуры

&НаСервере
Процедура УстановитьСтатусАрхивНаСервере()
	//Статус = Перечисления.ЛБ_СтатусыПриказовРежимРаботы.Архив; 
	Объект.Архив = Истина;
	Объект.ДатаОкончания = ТекущаяДата();
	ДокОбъект = РеквизитФормыВЗначение("Объект");
    ДокОбъект.Записать(РежимЗаписиДокумента.Запись);  
КонецПроцедуры 



&НаКлиенте
Процедура УстановитьСтатусАрхив(Команда)
	УстановитьСтатусАрхивНаСервере();
	УстановитьСтатусДокумента(); 
	УстановитьДоступностьЭлементов();
	Оповестить("Запись_РежимРаботы", Неопределено, Объект.Ссылка);  
КонецПроцедуры


Функция ПроверитьСтатусФактДругиеПриказы()
	тзЛомбарды = Объект.РежимРаботы.Выгрузить(,"Ломбард");
	тзЛомбарды.Свернуть("Ломбард");
	МассивЛомб = тзЛомбарды.ВыгрузитьКолонку("Ломбард");

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_ПриказРежимРаботыРежимРаботы.Ссылка КАК Приказ,
	               |	ЛБ_ПриказРежимРаботыРежимРаботы.Ломбард КАК Ломбард
	               |ИЗ
	               |	Документ.ЛБ_ПриказРежимРаботы.РежимРаботы КАК ЛБ_ПриказРежимРаботыРежимРаботы
	               |ГДЕ
	               |	ЛБ_ПриказРежимРаботыРежимРаботы.Ломбард В(&Ломбарды)
				   |    И ЛБ_ПриказРежимРаботыРежимРаботы.Ссылка.Проведен = Истина
	               |	И ЛБ_ПриказРежимРаботыРежимРаботы.Ссылка.Статус <> &Архивный
	               |	И ЛБ_ПриказРежимРаботыРежимРаботы.Ссылка <> &ТекПриказ
	               |	И ЛБ_ПриказРежимРаботыРежимРаботы.Ссылка.ВидПриказа = &ВидПриказа
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ЛБ_ПриказРежимРаботыРежимРаботы.Ссылка,
	               |	ЛБ_ПриказРежимРаботыРежимРаботы.Ломбард";
	Запрос.УстановитьПараметр("Ломбарды", МассивЛомб);
	Запрос.УстановитьПараметр("Статус", Перечисления.ЛБ_СтатусыПриказовРежимРаботы.Архив);
	Запрос.УстановитьПараметр("ВидПриказа", Перечисления.ЛБ_ВидыПриказаРежимаРаботы.Постоянный);
	
	Запрос.УстановитьПараметр("ТекПриказ", Объект.Ссылка);
	
	Рез = Ложь;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Рез = Истина; 
		//Сообщить("Уже есть приказ со статусом Факт: Приказ № "+СокрЛП(Выборка.Приказ.Номер)+" от "+Формат(Выборка.Приказ.Дата,"ДФ=dd.MM.yy")+", по ломбарду: "+СокрЛП(Выборка.ломбард));
	КонецЦикла;
	
	Возврат Рез;
	
КонецФункции


Функция ЕстьФактическийПриказ()
	
	Рез = Новый Структура;
	Рез.Вставить("Есть", Ложь); 
	Рез.Вставить("Дата", "");
    Рез.Вставить("Номер", "");

	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_ПриказРежимРаботы.Ссылка КАК Приказ,
	               |	ЛБ_ПриказРежимРаботы.Отделение КАК Отделение,
	               |	ЛБ_ПриказРежимРаботы.Номер КАК Номер,
	               |	ЛБ_ПриказРежимРаботы.Дата КАК Дата
	               |ИЗ
	               |	Документ.ЛБ_ПриказРежимРаботы КАК ЛБ_ПриказРежимРаботы
	               |ГДЕ
	               |	ЛБ_ПриказРежимРаботы.Отделение = &Отделение
	               |	И ЛБ_ПриказРежимРаботы.Ссылка.Проведен = ИСТИНА
	               |	И ЛБ_ПриказРежимРаботы.Ссылка.Архив = ЛОЖЬ
	               |	И ЛБ_ПриказРежимРаботы.Ссылка <> &ТекПриказ
	               |	И ЛБ_ПриказРежимРаботы.Ссылка.ВидПриказа = &ВидПриказа
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ЛБ_ПриказРежимРаботы.Ссылка,
	               |	ЛБ_ПриказРежимРаботы.Отделение,
	               |	ЛБ_ПриказРежимРаботы.Номер,
	               |	ЛБ_ПриказРежимРаботы.Дата";
	Запрос.УстановитьПараметр("Статус", Перечисления.ЛБ_СтатусыПриказовРежимРаботы.Архив);
	Запрос.УстановитьПараметр("ВидПриказа", Перечисления.ЛБ_ВидыПриказаРежимаРаботы.Постоянный);
	Запрос.УстановитьПараметр("Отделение", Объект.Отделение);
	Запрос.УстановитьПараметр("ТекПриказ", Объект.Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Рез.Вставить("Есть", Истина); 
		Рез.Вставить("Дата", Выборка.Дата);
    	Рез.Вставить("Номер", Выборка.Номер);

	КонецЦикла;
	
	Возврат Рез;
	
КонецФункции

&НаКлиенте
Процедура РежимРаботыБезПерерываПриИзменении(Элемент)
	ТекСтр = Элементы.РежимРаботы.ТекущиеДанные;
	Если ТекСтр.БезПерерыва Тогда
		ТекСтр.ПерерывНачало = "";
		ТекСтр.ПерерывОкончание = ""; 
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура БезПерерываВсеГалочки(Команда)
	Для каждого стр из Объект.РежимРаботы Цикл
		стр.БезПерерыва = Истина;
		стр.ПерерывНачало = "";
		стр.ПерерывОкончание = ""; 
	КонецЦикла; 
КонецПроцедуры

&НаКлиенте
Процедура БезПерерываСнятьГалочки(Команда)
	Для каждого стр из Объект.РежимРаботы Цикл
		стр.БезПерерыва = Ложь;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Оповестить("Запись_РежимРаботы", ПараметрыЗаписи, Объект.Ссылка);
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	УстановитьСтатусДокумента();
КонецПроцедуры

&НаКлиенте
Процедура Редактировать(Команда)
	ЭтаФорма.ТолькоПросмотр = Ложь;
	ОтменитьПроведение();
	УстановитьСтатусДокумента(); 
	ЭтаФорма.КоманднаяПанель.ПодчиненныеЭлементы.ФормаКнопка2.Видимость = Ложь; 
КонецПроцедуры

&НаСервере
Процедура ОтменитьПроведение()  
	Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.ОтменаПроведения));
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьИзПредыдущегоНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_ПриказРежимРаботы.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.ЛБ_ПриказРежимРаботы КАК ЛБ_ПриказРежимРаботы
	               |ГДЕ
	               |	ЛБ_ПриказРежимРаботы.Отделение = &Отделение
	               |	И ЛБ_ПриказРежимРаботы.Архив = ЛОЖЬ
	               |	И ЛБ_ПриказРежимРаботы.Проведен = ИСТИНА
	               |	И ЛБ_ПриказРежимРаботы.Ссылка <> &Ссылка";
	Запрос.УстановитьПараметр("Отделение", Объект.Отделение);
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Объект.РежимРаботы.Очистить();
		Для каждого стр из Выборка.Ссылка.РежимРаботы Цикл
			НовСтр = Объект.РежимРаботы.Добавить();
			ЗаполнитьЗначенияСвойств(НовСтр, стр);
		КонецЦикла;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьИзПредыдущего(Команда)
	ЗаполнитьИзПредыдущегоНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура РежимРаботыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение и Объект.ВидПриказа = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыПриказаРежимаРаботы.Постоянный") Тогда
		глПараметрыЗаписи = ПараметрыЗаписи;  
		
		
		Рез = ЕстьФактическийПриказ(); 
		
			
		
		Если ОтказатьВПроведении = Неопределено и Рез.Есть Тогда 
			ТекстВопр = "При вступлении в действие настоящего приказа постоянный приказ № "+ СокрЛП(Рез.Номер)+" от "+Формат(Рез.Дата,"ДФ=dd.MM.yy") + " будет переведен в архив";
			ДиалогСВопросом(ТекстВопр);
			Отказ=Истина; 
		Иначе 
			Отказ=ОтказатьВПроведении;
			ОтказатьВПроведении=Неопределено;
		КонецЕсли;
	КонецЕсли;  
КонецПроцедуры
 
&НаКлиенте
Процедура ДиалогСВопросом(ТекстВопр)
    Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопроса",ЭтотОбъект); 
    ПоказатьВопрос(Оповещение,Строка(ТекстВопр),
                    РежимДиалогаВопрос.ДаНет,0,КодВозвратаДиалога.Да,"Продолжить проведение?");    
КонецПроцедуры
 
&НаКлиенте
Процедура ПослеЗакрытияВопроса(Результат, Параметры) Экспорт
    Если Результат = КодВозвратаДиалога.Да Тогда
        ОтказатьВПроведении=Ложь; 
		ПеревестиПредыдущийПриказВАрхив();		
    Иначе
        ОтказатьВПроведении=Истина;
    КонецЕсли; 
    Записать(глПараметрыЗаписи);
КонецПроцедуры  

Процедура ПеревестиПредыдущийПриказВАрхив() 
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_ПриказРежимРаботы.Ссылка КАК Приказ
	               |ИЗ
	               |	Документ.ЛБ_ПриказРежимРаботы КАК ЛБ_ПриказРежимРаботы
	               |ГДЕ
	               |	ЛБ_ПриказРежимРаботы.Отделение = &Отделение
	               |	И ЛБ_ПриказРежимРаботы.Ссылка.Проведен = ИСТИНА
	               |	И ЛБ_ПриказРежимРаботы.Ссылка.Архив = ЛОЖЬ
	               |	И ЛБ_ПриказРежимРаботы.Ссылка <> &ТекПриказ
	               |	И ЛБ_ПриказРежимРаботы.Ссылка.ВидПриказа = &ВидПриказа
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ЛБ_ПриказРежимРаботы.Ссылка,
	               |	ЛБ_ПриказРежимРаботы.Отделение,
	               |	ЛБ_ПриказРежимРаботы.Номер,
	               |	ЛБ_ПриказРежимРаботы.Дата";
	Запрос.УстановитьПараметр("Статус", Перечисления.ЛБ_СтатусыПриказовРежимРаботы.Архив);
	Запрос.УстановитьПараметр("ВидПриказа", Перечисления.ЛБ_ВидыПриказаРежимаРаботы.Постоянный);
	Запрос.УстановитьПараметр("Отделение", Объект.Отделение);
	Запрос.УстановитьПараметр("ТекПриказ", Объект.Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл  
		Об = Выборка.Приказ.ПолучитьОбъект();
		//Об.Архив = Истина; 
		//Об.Статус = Перечисления.ЛБ_СтатусыПриказовРежимРаботы.Архив; 
		Если Не ЗначениеЗаполнено(Об.ДатаОкончания) Тогда
			Об.ДатаОкончания = НачалоДня(Объект.ДатаНачала) - 86400;
		КонецЕсли;
		Об.Записать();
	КонецЦикла;
	

КонецПроцедуры

&НаКлиенте
Процедура ПечатьПриложения(Команда)
	Таб = ПечатьПриложенияНаСервере(); 
	Таб.Показать("");

КонецПроцедуры


Функция ПечатьПриложенияНаСервере() 
	
		Таб = Новый ТабличныйДокумент;
		Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ЛБ_ПриказРежимРаботы.Приложение1"); 
		
		Обл = Макет.ПолучитьОбласть("Шапка");
		Обл.Параметры.Номер = Объект.Номер; 
		Обл.Параметры.Дата  = Формат(Объект.Дата, "ДФ=dd.MM.yyyy");
		Обл.Параметры.ДатаНачала  = Формат(Объект.ДатаНачала, "ДФ=dd.MM.yyyy");
		Таб.Вывести(Обл); 
		
		тзЛомб = Объект.РежимРаботы.Выгрузить();
		тзЛомб.Свернуть("Ломбард"); 
		
				
		Для каждого стрЛомб из тзЛомб Цикл  
			отбор = Новый Структура("Ломбард", стрЛомб.Ломбард);
			Обл = Макет.ПолучитьОбласть("Строка"); 
			Обл.Параметры.Ломбард = стрЛомб.Ломбард;
			
			НайденныеСтроки = Объект.РежимРаботы.НайтиСтроки(отбор);
			Для каждого стр из НайденныеСтроки Цикл
							
				Обл.Параметры["Начало"+СокрЛП(стр.НомерДня)] = Формат(стр.Начало, "ДФ=ЧЧ:мм"); 
				Обл.Параметры["Окончание"+СокрЛП(стр.НомерДня)] = Формат(стр.Окончание, "ДФ=ЧЧ:мм");
				
				Если стр.БезПерерыва Тогда
					Обл.Параметры["ПерерывНачало"+СокрЛП(стр.НомерДня)] = "Нет"; 
					Обл.Параметры["ПерерывОкончание"+СокрЛП(стр.НомерДня)] = "-";
				Иначе
					Обл.Параметры["ПерерывНачало"+СокрЛП(стр.НомерДня)] = Формат(стр.ПерерывНачало, "ДФ=ЧЧ:мм"); 
					Обл.Параметры["ПерерывОкончание"+СокрЛП(стр.НомерДня)] = Формат(стр.ПерерывОкончание, "ДФ=ЧЧ:мм");  
				КонецЕсли;
				
			КонецЦикла;	
				
			Таб.Вывести(Обл);
		КонецЦикла;  
		
		Таб.ТолькоПросмотр = Истина; 
		Таб.ОтображатьСетку = Ложь; 
		Таб.ОтображатьГруппировки = Ложь;
		Таб.ОтображатьЗаголовки = Ложь;
				
		Возврат Таб;	

	
КонецФункции  
	
	
	&НаКлиенте 
Процедура Подключаемый_ВыполнитьКомандуПечати(Команда) 
	УправлениеПечатьюКлиент.ВыполнитьПодключаемуюКомандуПечати(Команда, ЭтаФорма, Объект); 
КонецПроцедуры

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	//ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
	ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
	ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры 

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
